{"class_name": "Model", "keras_version": "1.2.1", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "class_name": "Convolution2D", "config": {"name": "block1_conv1", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "class_name": "Convolution2D", "config": {"name": "block1_conv2", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2]}}, {"inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "class_name": "Convolution2D", "config": {"name": "block2_conv1", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 128, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "class_name": "Convolution2D", "config": {"name": "block2_conv2", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 128, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2]}}, {"inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "class_name": "Convolution2D", "config": {"name": "block3_conv1", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 256, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "class_name": "Convolution2D", "config": {"name": "block3_conv2", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 256, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "class_name": "Convolution2D", "config": {"name": "block3_conv3", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 256, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2]}}, {"inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "class_name": "Convolution2D", "config": {"name": "block4_conv1", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "class_name": "Convolution2D", "config": {"name": "block4_conv2", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "class_name": "Convolution2D", "config": {"name": "block4_conv3", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2]}}, {"inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "class_name": "Convolution2D", "config": {"name": "block5_conv1", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "class_name": "Convolution2D", "config": {"name": "block5_conv2", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "class_name": "Convolution2D", "config": {"name": "block5_conv3", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 512, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "trainable": false, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2]}}, {"inbound_nodes": [[["block5_pool", 0, 0]]], "name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "globalaveragepooling2d_1", "dim_ordering": "tf", "trainable": true}}, {"inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 100, "input_dim": 512, "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 50, "input_dim": 100, "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 10, "input_dim": 50, "b_regularizer": null, "bias": true}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_output", "class_name": "Dense", "config": {"name": "dense_output", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 1, "input_dim": 10, "b_regularizer": null, "bias": true}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_output", 0, 0]]}}