{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "nb_row": 5, "input_dtype": "float32", "init": "glorot_uniform", "nb_filter": 24, "batch_input_shape": [null, 66, 200, 3], "activation": "elu", "name": "convolution2d_1", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "b_constraint": null, "W_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 36, "activation": "elu", "name": "convolution2d_2", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "b_constraint": null, "W_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 48, "activation": "elu", "name": "convolution2d_3", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "activation": "elu", "name": "convolution2d_4", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "activation": "elu", "name": "convolution2d_5", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "activation": "elu", "name": "dense_1", "input_dim": null, "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "activation": "elu", "name": "dense_2", "input_dim": null, "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "activation": "elu", "name": "dense_3", "input_dim": null, "b_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "activation": "linear", "name": "dense_4", "input_dim": null, "b_regularizer": null, "W_constraint": null, "bias": true}}]}