{"keras_version": "1.1.2", "config": [{"config": {"nb_filter": 32, "activation": "relu", "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 100, 100, 3], "subsample": [1, 1], "b_regularizer": null, "nb_col": 3, "bias": true, "nb_row": 3, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 32, "activation": "relu", "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 32, "activation": "relu", "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "activation": "relu", "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_4", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 128, "activation": "relu", "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_5", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "output_dim": 1024, "name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "relu", "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "output_dim": 512, "name": "dense_2", "activity_regularizer": null, "trainable": true, "activation": "relu", "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "output_dim": 1, "name": "dense_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}