{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_6", "nb_filter": 24, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "nb_row": 5, "input_dtype": "float32", "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "border_mode": "valid", "activation": "elu", "name": "convolution2d_7", "nb_filter": 36, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "nb_row": 5, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "border_mode": "valid", "activation": "elu", "name": "convolution2d_8", "nb_filter": 48, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "nb_row": 5, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_col": 3, "bias": true, "border_mode": "valid", "activation": "elu", "name": "convolution2d_9", "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "nb_row": 3, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_col": 3, "bias": true, "border_mode": "valid", "activation": "elu", "name": "convolution2d_10", "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "nb_row": 3, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "output_dim": 100, "b_constraint": null, "bias": true, "name": "dense_5", "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 1152, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "output_dim": 50, "b_constraint": null, "bias": true, "name": "dense_6", "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 100, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "output_dim": 10, "b_constraint": null, "bias": true, "name": "dense_7", "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 50, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 1, "b_constraint": null, "bias": true, "name": "dense_8", "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": 10, "W_regularizer": null}}]}