{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "dim_ordering": "tf", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "nb_col": 5, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_row": 5, "nb_filter": 24, "activity_regularizer": null, "name": "convolution2d_6", "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "elu", "subsample": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_8"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 5, "nb_filter": 36, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "elu", "name": "convolution2d_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_9"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 5, "nb_filter": 48, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "elu", "name": "convolution2d_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_10"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 3, "nb_filter": 64, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "elu", "name": "convolution2d_9"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_11"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "nb_row": 3, "nb_filter": 64, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "elu", "name": "convolution2d_10"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_12"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "activation": "elu", "output_dim": 100, "input_dim": 1152, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_13"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "activation": "elu", "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_14"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "activation": "elu", "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_7"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "activation": "linear", "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_8"}}]}