{"config": [{"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 3], "nb_filter": 24, "nb_row": 5, "bias": true, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "b_regularizer": null, "input_dtype": "float32", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_2", "W_regularizer": null, "nb_filter": 36, "nb_row": 5, "bias": true, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_3", "W_regularizer": null, "nb_filter": 48, "nb_row": 5, "bias": true, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_4", "W_regularizer": null, "nb_filter": 64, "nb_row": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_5", "W_regularizer": null, "nb_filter": 64, "nb_row": 3, "bias": true, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": 1152, "output_dim": 100, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": 100, "output_dim": 50, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "name": "dense_3", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": 50, "output_dim": 10, "W_constraint": null, "trainable": true, "activation": "elu"}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "name": "dense_4", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "input_dim": 10, "output_dim": 1, "W_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}