{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "subsample": [2, 2], "nb_row": 5, "activation": "elu", "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_1", "trainable": true, "input_dtype": "float32", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "nb_filter": 24, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "elu", "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "nb_filter": 36, "W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "elu", "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "nb_filter": 48, "W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "elu", "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "elu", "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "trainable": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 100, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.2}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "trainable": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 50, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.2}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "trainable": true, "activation": "elu", "W_constraint": null, "b_regularizer": null, "output_dim": 10, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "output_dim": 1, "name": "dense_4", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null}}]}