{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "batch_input_shape": [null, 100, 100, 3], "bias": true, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "name": "convolution2d_1", "nb_row": 3, "nb_filter": 32, "activation": "relu", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dtype": "float32", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "bias": true, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 32, "name": "convolution2d_2", "subsample": [1, 1], "nb_row": 3, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "bias": true, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 32, "name": "convolution2d_3", "subsample": [1, 1], "nb_row": 3, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "bias": true, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_4", "subsample": [1, 1], "nb_row": 3, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "bias": true, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 128, "name": "convolution2d_5", "subsample": [1, 1], "nb_row": 3, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_5", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1024, "activity_regularizer": null, "trainable": true, "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 512, "activity_regularizer": null, "trainable": true, "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 1, "activity_regularizer": null, "trainable": true, "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "name": "dense_3", "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}}]}