{"config": [{"config": {"W_constraint": null, "nb_row": 5, "border_mode": "valid", "activation": "elu", "dim_ordering": "tf", "b_regularizer": null, "input_dtype": "float32", "nb_filter": 24, "name": "convolution2d_1", "bias": true, "trainable": true, "nb_col": 5, "b_constraint": null, "batch_input_shape": [null, 66, 200, 3], "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "elu", "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "bias": true, "trainable": true, "nb_col": 5, "b_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "elu", "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "bias": true, "trainable": true, "nb_col": 5, "b_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "elu", "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "name": "convolution2d_4", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "elu", "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "bias": true, "trainable": true, "nb_col": 3, "b_regularizer": null, "name": "convolution2d_5", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_5", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "input_dim": null, "activation": "elu", "b_regularizer": null, "name": "dense_1", "bias": true, "trainable": true, "b_constraint": null, "output_dim": 100, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "input_dim": null, "activation": "elu", "b_regularizer": null, "name": "dense_2", "bias": true, "trainable": true, "b_constraint": null, "output_dim": 50, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "input_dim": null, "activation": "elu", "b_regularizer": null, "name": "dense_3", "bias": true, "trainable": true, "b_constraint": null, "output_dim": 10, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "input_dim": null, "activation": "linear", "b_regularizer": null, "name": "dense_4", "bias": true, "trainable": true, "b_constraint": null, "output_dim": 1, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}