{"keras_version": "1.2.1", "config": [{"config": {"b_constraint": null, "subsample": [2, 2], "input_dtype": "float32", "dim_ordering": "tf", "activation": "elu", "trainable": true, "nb_row": 5, "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "nb_filter": 24, "activity_regularizer": null, "bias": true, "name": "convolution2d_1", "W_constraint": null, "nb_col": 5, "b_regularizer": null, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "activation": "elu", "nb_row": 5, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 36, "activity_regularizer": null, "bias": true, "name": "convolution2d_2", "W_constraint": null, "nb_col": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "activation": "elu", "nb_row": 5, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "bias": true, "name": "convolution2d_3", "W_constraint": null, "nb_col": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activation": "elu", "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "bias": true, "name": "convolution2d_4", "W_constraint": null, "nb_col": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activation": "elu", "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "bias": true, "name": "convolution2d_5", "W_constraint": null, "nb_col": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "W_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "input_dim": 1152, "activity_regularizer": null, "bias": true, "name": "dense_1", "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "input_dim": 100, "activity_regularizer": null, "bias": true, "name": "dense_2", "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "W_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "activation": "elu", "input_dim": 50, "activity_regularizer": null, "bias": true, "name": "dense_3", "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"b_constraint": null, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "input_dim": 10, "activity_regularizer": null, "bias": true, "name": "dense_4", "W_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}