{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "batch_input_shape": [null, 100, 100, 3], "name": "convolution2d_9", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "bias": true, "input_dtype": "float32", "activity_regularizer": null, "border_mode": "valid", "nb_filter": 32, "b_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "name": "convolution2d_10", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "bias": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 32, "nb_row": 3, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_10"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "name": "convolution2d_11", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "bias": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 64, "nb_row": 3, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_11"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "name": "convolution2d_12", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "bias": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 128, "nb_row": 3, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_12"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "name": "dense_7", "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "output_dim": 1024, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "name": "dense_8", "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "output_dim": 512, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "name": "dense_9", "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "activation": "linear"}}]}